import re


def clean_text(text: str):
    bruh = {
        '[Рр](оссийская\s*[Фф]едерация|оссия|[Фф])': '',
        '\d{6}': '  ',
        ' (Г|г)(ор|ород|) ':  ' город ',
        ' [Уу](л.|лица|ул)\s' : ' улица ',
        ' [Пп](роспект|р-кт|р кт|р-кт|р)' : ' проспект ',
        ' [Рр](айон|-н|-он)\s': ' район ',
        ' [Пп](ос|оселок|осёлок|) ': ' поселок ',
        ' [сC](танция|т) ': ' станция ',
        ' [Уу](часток|ч) ': ' участок ',
        ' [Рр](ека\s|) ': ' река ',
        ' [Пп](ер|ереулок) ': ' переулок ',
        ' [Дд](ом|) ': ' дом ',
        ' [Кк](орпус|) ': ' корпус ',
        ' [Сс]тр(оение|оен|оен|) ': ' строение ',
        ' [Дд](ор|орога) ': ' дорога ',
        ' [Лл](итера|ит|) ': ' литера ',
        ' [Дд](еревня|ер|) ': ' деревня ',
        ' [Бб](ульв|уль|ульвар|-р) ' : ' бульвар ',
        ' [Нн](аб|абереж|абережная) ': ' набережная ',
        ' [Сс](адовоство|сад|садовод) ': ' садоводство ',
        ' с(\/|\s*|\-|\.|)т(\.|) ': ' Садоводческое товарищество ',
        ' [Кк](анал|ан\.) ': ' канал',
        ' [Жж](\/|\s*|\-|\.|)д(\.|) ': ' железная дорога ',
        ' свх\. ': ' совхоз ',
        ' потреб\. кооператив садоводства ': ' потребительский кооператив садоводства ',
    }

    def substraction(a):
        a = ' ' + a + ' '
        a = re.sub(r'[\(\)]', '  ', a)
        a = re.sub('((Г|г|)(ор\.\s*|ород|\.|))*[Сс](анкт-|анкт\s*|)[Пп](етербург|[Бб])(\s(Г|г|)(ор\.\s*|ород|\.|))*', '', a)
        a = re.sub('\.', '  ', a)
        a = re.sub(',', '  ', a)
        for i in bruh.keys():
            a = re.sub(i, bruh[i], a)
        a = a.lstrip().rstrip().lower()
        return re.sub(r'[-.?!)(,:\/\\]', ' ', a)

    return substraction(text)
